---
kind: other
id: Properties.T:Autodesk.Revit.DB.ComponentRepeaterIterator
source: html/b7548ddf-17b2-8a17-e067-6b39e470c59a.htm
---
# ComponentRepeaterIterator Properties

Gets the item at the current position of the iterator.